In [14]:
import pandas as pd

In [94]:

dict1={"Name":["Priyang","Aadhya","Krishna","Vedant","Parshv","Mittal","Archana"],"Marks":[98,89,99,87,90,83,99],"Gender":["Male","Female","Male","Male","Male","Male","Female"]}

df1= pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99    Male
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83    Male
6  Archana     99  Female

In [95]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99    Male

In [96]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83    Male
6  Archana     99  Female

In [97]:
df1.shape

(7, 3)

In [98]:
print("The number of Rows is",df1.shape[0])

The number of Rows is 7

In [99]:
print("The number of Columns is",df1.shape[1])

The number of Columns is 3

In [100]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [101]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [102]:
df1.describe(include='all')

           Name      Marks Gender
count         7   7.000000      7
unique        7        NaN      2
top     Priyang        NaN   Male
freq          1        NaN      5
mean        NaN  92.142857    NaN
std         NaN   6.491753    NaN
min         NaN  83.000000    NaN
25%         NaN  88.000000    NaN
50%         NaN  90.000000    NaN
75%         NaN  98.500000    NaN
max         NaN  99.000000    NaN

In [103]:
# Find the Unique Values from the Gender Column

df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [104]:
#  Find the Number of  Unique Values from the Gender Column

df1['Gender'].nunique()

2

In [105]:
# Display Count of Unique Values in Gender Column

df1['Gender'].value_counts()

Gender
Male      5
Female    2
Name: count, dtype: int64

In [106]:
# Find the Total Nummber of Student Having Marks Between 90 TO 100 Using Between Method

# Without using Between Method
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2  Krishna     99    Male
4   Parshv     90    Male
6  Archana     99  Female

In [107]:
# Without using Between Method
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [108]:
sum(df1['Marks'].between(90,100))

4

In [109]:
# Find Average Marks

df1['Marks'].mean()

92.14285714285714

In [110]:
# Find the Minimun and Maximum Marks

In [111]:
df1['Marks'].min()

83

In [112]:
df1['Marks'].max()

99

In [113]:
# Apply Method-> Create Custom Methods

def Marks(arg):
    return arg//2

In [114]:
df1['Half Marks']= df1['Marks'].apply(Marks)

df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99    Male          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83    Male          41
6  Archana     99  Female          49

In [115]:
df1['Half Marks']= df1['Marks'].apply(lambda x: x//2)

df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99    Male          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83    Male          41
6  Archana     99  Female          49

In [116]:
# Get Length of String in Name Column
df1['Name Count']= df1['Name'].apply(len)
df1

      Name  Marks  Gender  Half Marks  Name Count
0  Priyang     98    Male          49           7
1   Aadhya     89  Female          44           6
2  Krishna     99    Male          49           7
3   Vedant     87    Male          43           6
4   Parshv     90    Male          45           6
5   Mittal     83    Male          41           6
6  Archana     99  Female          49           7

In [117]:
# Map Funcation

df1['Male_Female']= df1['Gender'].map({'Male':1,'Female':2})

In [118]:
# Drop the Column
df1.drop('Male_Female', axis=1)

      Name  Marks  Gender  Half Marks  Name Count
0  Priyang     98    Male          49           7
1   Aadhya     89  Female          44           6
2  Krishna     99    Male          49           7
3   Vedant     87    Male          43           6
4   Parshv     90    Male          45           6
5   Mittal     83    Male          41           6
6  Archana     99  Female          49           7

In [120]:
# Drop the Columns
df1.drop(['Half Marks','Name Count','Male_Female'], axis=1, inplace=True)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99    Male
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83    Male
6  Archana     99  Female

In [131]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99    Male
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83    Male
6  Archana     99  Female

In [134]:
# Print the Name of the Columns
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [135]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [136]:
# sort the dataFrame as per the marks Column
# In Asending Order
df1.sort_values(by="Marks")

      Name  Marks  Gender
5   Mittal     83    Male
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2  Krishna     99    Male
6  Archana     99  Female

In [139]:
# Desending Order
df1.sort_values(by="Marks", ascending=False)

      Name  Marks  Gender
2  Krishna     99    Male
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83    Male

In [144]:
# Display the Name of Female Only
# Method 1
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
6  Archana     99

In [148]:
# Method 2
df1[df1["Gender"].isin(['Female'])][["Name","Marks"]]

      Name  Marks
1   Aadhya     89
6  Archana     99